// Задание 1: Поиск элемента в массиве

// Задайте массив целых чисел. Напишите программу, которая проверяет
// присутствует ли заданное число в массиве. Программа должна вывести:
// Присутствует/Не присутствует.



// int[] array = [2, 4, 6, 8, 5, 7, 9, 1, 3];
// int sum = 10;

// bool isExistNum = false;

// for (int i = 0; i < array.Length; i++)
// {
//     if (array[i] == sum)
//     {
//         isExistNum = true;
//         break;
//     }
// }

// if (isExistNum)
// {
//     Console.WriteLine("Присуствует");
// }
// else
// {
//     Console.WriteLine("Не присуствует");
// }



// Задание 2: Замена элементов массива

// Описание: Задайте массив из 10 элементов, заполненный числами от -10 до 10.
// Замените отрицательные числа на их абсолютные значения, а положительные числа
// на их отрицательные эквиваленты.



// int[] array = { 1, -5, 6, -7, 3 };

// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = array[i] *= -1;
// }

// for (int i = 0; i < array.Length; i++)
// {
//     Console.Write(array[i] + " ");
// }




// Задание 3: Поиск среднего значения массива
// Описание: Задайте массив из 10 целых чисел. Найдите среднее значение элементов
// массива.


// int[] numbers = [2, 5, 7, 10, 12, 15, 20, 22, 25, 30 ];

// int sum = 0;

// for (int i = 0; i < numbers.Length; i++)
// { 
//     sum += numbers[i]; 
// }

// double average = (double)sum / numbers.Length;

// Console.WriteLine("Среднее значение: " + average);


